# Concatenating Data Frames

In [1]:
import numpy as np
import pandas as pd

In [2]:
dataone = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
datatwo = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}

In [3]:
d1 = pd.DataFrame(dataone)
d2 = pd.DataFrame(datatwo)

In [4]:
d1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
pd.concat([d1,d2],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
d1.columns = d2.columns

In [7]:
df1 = pd.concat([d1,d2])

In [8]:
df1

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
df1.index = range(len(df1))

In [10]:
df1

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

# Merging Data Frames

In [14]:
reg_data = { 'reg_id' : [1,2,3,4], 'name' : ['Andrew', 'Bob', 'Charlie', 'David']}
reg = pd.DataFrame(reg_data)

In [16]:
reg

   reg_id     name
0       1   Andrew
1       2      Bob
2       3  Charlie
3       4    David

In [17]:
log_data = { 'log_id' : [1,2,3,4], 'name' : ['Xavier', 'Andrew', 'Yolando', 'Bob']}
log = pd.DataFrame(log_data)

In [18]:
log

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolando
3       4      Bob

In [19]:
result = pd.merge(reg, log, how = 'inner', on = 'name', sort = False)

In [20]:
result

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

# Left and Right Merge

In [21]:
reg_data = { 'reg_id' : [1,2,3,4], 'name' : ['Andrew', 'Bob', 'Charlie', 'David']}
reg = pd.DataFrame(reg_data)
log_data = { 'log_id' : [1,2,3,4], 'name' : ['Xavier', 'Andrew', 'Yolando', 'Bob']}
log = pd.DataFrame(log_data)

In [22]:
results = pd.merge(reg, log, how = 'left', on = 'name', sort = True)

In [23]:
results

   reg_id     name  log_id
0       1   Andrew     2.0
1       2      Bob     4.0
2       3  Charlie     NaN
3       4    David     NaN

In [24]:
results = pd.merge(reg, log, how = 'right', on = 'name', sort = True)

In [25]:
results

   reg_id     name  log_id
0     1.0   Andrew       2
1     2.0      Bob       4
2     NaN   Xavier       1
3     NaN  Yolando       3

# Outer Merge

In [26]:
reg_data = { 'reg_id' : [1,2,3,4], 'name' : ['Andrew', 'Bob', 'Charlie', 'David']}
reg = pd.DataFrame(reg_data)
log_data = { 'log_id' : [1,2,3,4], 'name' : ['Xavier', 'Andrew', 'Yolando', 'Bob']}
log = pd.DataFrame(log_data)

In [27]:
results = pd.merge(reg, log, how = 'outer', on = 'name')

In [28]:
results

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0  Charlie     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolando     3.0